app/Http/Controllers/API/NewsPostApiController.php

select * from `news_posts` where `news_posts`.`id` = '13' limit 1
delete from `news_posts` where `id` = 13
---
    public function destroy($id)
    {
        //delete a news post
        try {
            $news_post = NewsPost::find($id);
            if ($news_post) {
                $news_post->delete();