app/Http/Controllers/API/ServiceProviderAPIController.php

insert into `service_providers` (`name`, `registration_number`, `date_of_registration`, `user_id`, `brief_profile`, `physical_address`, `attachments`, `logo`, `license`, `certificate_of_registration`, `is_verified`, `email`, `telephone`, `services_offered`, `level_of_operation`, `mission`, `postal_address`, `target_group`, `affiliated_organizations`, `updated_at`, `created_at`) values ('Sanyu Lyange (SL)', '', '', '', '', 'Plot 99 Ntinda-Nakawa Road', 'null', '', '', '', 0, 'sentep@yahoo.com', '256 414 597 952', 'Signhealth UK, All DPOs, Groups of parents of Deaf and Deafblind children, youth, CSOs, Government and other Development partners', 'National', 'To promote equitable access to social services and opportunities for Deaf, Deafblind persons and their families in Uganda.', '36563, Kampala', 'Men, women,children and families of the deaf and deafblind in Uganda.', 'NULL', '2024-03-25 12:49:02', '2024-03-25 12:49:02')
---
    public function store(ServiceProviderStoreRequest $request)
    {
        //storing service providers
        try {
            $service_provider = ServiceProvider::create($request->all());

select * from `service_providers` where `service_providers`.`id` = '182' limit 1
delete from `service_providers` where `id` = 182
---
    public function destroy($id)
    {
        //deleting service provider
        try {
            $service_provider = ServiceProvider::find($id);
            if ($service_provider) {
                $service_provider->delete();