app/Admin/Controllers/DistrictUnionController.php

    protected function grid()
    {
        $grid = new Grid(new Organisation());
        $grid->disableBatchActions();
        $grid->quickSearch('name')->placeholder('Search by Name');
        $grid->filter(function ($filter) {
            $filter->disableIdFilter();
            //Filters for region, membership type and date of registration
            $filter->equal('region.name', 'Region')
                ->select(Region::pluck('name', 'name'));
            $filter->equal('membership_type', 'Membership Type')
                ->select(Organisation::pluck('membership_type', 'membership_type'));
---
select `name`, `name` from `regions`
select `membership_type`, `membership_type` from `organisations`

    protected function form()
    {
        $form = new Form(new Organisation());

        $form->footer(function ($footer) {
            $footer->disableReset();
            $footer->disableViewCheck();
            $footer->disableEditingCheck();
            $footer->disableCreatingCheck();
            $footer->disableSubmit();
        });

        $form->tab('Info', function ($form) {
            $form->text('name', __('Name'))->rules("required");
            $form->select('district_id', __('District Of Operation'))->options(District::orderBy('name', 'asc')->pluck('name', 'id'))->rules("required");
---
select `name`, `id` from `districts` order by `name` asc

            }
        });

        $form->saving(function ($form) {

            // save the admin in users and map to this du
            if ($form->isCreating()) {
                $du_exists = Organisation::where('district_id', $form->district_id)->where('relationship_type', 'du')->exists();
                if ($du_exists) {
                    admin_error('District Union already exists', 'Please check the district and try again');
                    return back();
                }
                //generate random password for user and send it to the user's email
                $alpha_list = 'ABCDEFGHJKLMNPQRSTUVWXYZabcdefghijkmnpqrstuvwxyz1234567890';
                $password = substr(str_shuffle($alpha_list), 0, 8);

                $admin_email = $form->admin_email;

                $new_password = $password;
                $password = Hash::make($password);
                //check if user exists
                $admin = User::where('email', $admin_email)->first();

                if ($admin == null) {
                    $admin = User::create([
                        'username' => $admin_email,
                        'email' => $form->admin_email,
                        'password' => $password,
                        'name' => $form->name,
                        'avatar' => $form->logo,
                    ]);
---
select exists(select * from `organisations` where `district_id` = '57' and `relationship_type` = 'du') as `exists`
select * from `users` where `email` = 'negy@mailinator.com' limit 1
insert into `users` (`username`, `email`, `password`, `name`, `avatar`, `updated_at`, `created_at`) values ('negy@mailinator.com', 'negy@mailinator.com', '$2y$10$VmbwYWu1Ohz6R82FHxKyNu24H9tpA0q.YyjTtNLqCvoLtAuHVhnPK', 'Malcolm Donovan', '', '2024-03-11 06:28:09', '2024-03-11 06:28:09')