app/Admin/Controllers/DuDashboardController.php

    public function index(Content $content)
    {
        $user = auth("admin")->user();
        $organisation = Organisation::where('user_id', $user->id)->first();
        if (!$organisation) {
            return redirect()->route('admin.dashboard');
        }
        $content
            ->description('Hello, welcome to ' . $organisation->name . ' Dashboard');

        $content->row(function (Row $row) {
            $row->column(3, function (Column $column) {
                $organisation = Organisation::where('user_id', auth("admin")->user()->id)->first();
                $district_id = $organisation->district_id;
                $count_pwd = Person::where('district_id', $district_id)->count();
                $box = new Box("Persons with Diability", '<h3 style="text-align:center; margin:0; font-size:40px; font-weight: bold;">' . $count_pwd . '</h3>');
                $box->style('success')
                    ->solid();
                $column->append($box, view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Persons with Disability',
                    'sub_title' => 'pwds',
                    'number' => $count_pwd,
                    'font_size' => '1.5em'
                ]));
            });
            $row->column(3, function (Column $column) {
                $organisation = Organisation::where('user_id', auth("admin")->user()->id)->first();
                $service_providers = ServiceProvider::with('districts_of_operation')->where('id', $organisation->district_id)->count();
                $box = new Box("Service Providers",  '<h3 style="text-align:center; margin:0; font-size:40px; font-weight: bold;">' . $service_providers . '</h3>');
                $box->style('success')
                    ->solid();
                $column->append($box, view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Service Providers',
                    'sub_title' => 'service providers',
                    'font_size' => '1.5em',
                    'number' => $service_providers,
                    // 'link' => admin_url('opds'),
                ]));
            });
---
select * from `organisations` where `user_id` = 143 limit 1
select count(*) as aggregate from `service_providers` where `id` = 16

                $column->append($box);
            });

            $row->column(3, function (Column $column) {
                $box = new Box("Products and Services",  '<h3 style="text-align:center; margin:0; font-size:40px; font-weight: bold;">' . Product::count() . '</h3>');
                $box->style('success')
                    ->solid();
                $column->append($box);
            });
---
select count(*) as aggregate from `products`