app/Admin/Controllers/DuDashboardController.php

    public function index(Content $content)
    {
        $user = Admin::user();
        $organisation = Organisation::find($user->organisation_id);
        if (!$organisation) {
            Utils::check_default_organisation();
            $organisation = Organisation::find($user->organisation_id);
            if ($organisation == null) {
                die("Organisation not found");
            }
        }
        $content
            ->description('Hello, welcome to ' . $organisation->name . ' Dashboard');

        $content->row(function (Row $row) {
            $row->column(3, function (Column $column) {
                $user = Admin::user();
                $organisation = Organisation::find($user->organisation_id);
                $district_id = $organisation->district_id;
                $count_pwd = Person::where('district_id', $district_id)->count();

                // Prepare data for the view
                $widgetData = [
                    'is_dark' => false,
                    'title' => 'Persons with Disability',
                    'sub_title' => 'pwds',
                    'number' => $count_pwd,
                    'font_size' => '1.5em',
                    'link' => admin_url("people?district_id={$district_id}"),
                ];

                $box_content = "<h3 style='text-align:center; margin:0; font-size:40px; font-weight: bold;'>{$widgetData['number']}</h3>
                                <p>{$widgetData['sub_title']}</p>";
                $box_content .= '<a href="' . $widgetData['link'] . '" style="display: block; position: absolute; top: 0; left: 0; width: 100%; height: 100%; z-index: 1;"></a>';

                $box = new Box($widgetData['title'], $box_content);
---
select count(*) as aggregate from `people` where `district_id` = 16