app/Admin/Controllers/HomeController.php

                ]));
            });
            $row->column(3, function (Column $column) {
                $column->append(view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Service providers',
                    'sub_title' => 'All time.',
                    'number' => ServiceProvider::count(),
                    'link' => admin_url('service-providers'),
                ]));
---
select count(*) as aggregate from `service_providers`

                    'is_dark' => false,
                    'title' => 'Products & Services',
                    'sub_title' => 'All time.',
                    'number' => Product::count(),
---
select count(*) as aggregate from `products`


            $row->column(12, function (Column $column) {
                //groups persons with disabilities by districts
                $districts = DB::table('people')
                    ->join('districts', 'people.district_id', '=', 'districts.id')
                    ->select('districts.name', DB::raw('COUNT(*) as count'))
                    ->groupBy('districts.name')
                    ->get();
---
select `disabilities`.`name`, COUNT(*) as count from `people` inner join `disability_person` on `people`.`id` = `disability_person`.`person_id` inner join `disabilities` on `disability_person`.`disability_id` = `disabilities`.`id` group by `disabilities`.`name`

                ]));
            });
        });
        $content->row(function (Row $row) {
            $row->column(6, function (Column $column) {
                //group pesons with disabilities by categories
                $persons = DB::table('people')
                    ->join('disability_person', 'people.id', '=', 'disability_person.person_id')
                    ->join('disabilities', 'disability_person.disability_id', '=', 'disabilities.id')
                    ->select('disabilities.name', DB::raw('COUNT(*) as count'))
                    ->groupBy('disabilities.name')
                    ->get();



                $column->append(view('widgets.by-categories', [
                    'title' => 'Persons with Disabilities by Categories',
                    'data' => $persons->pluck('count')->toArray(),
                    'labels' =>  $persons->pluck('count', 'name')->map(function ($count, $name) {
                                        return "$name - $count";
                                    })->values()->toArray()
                ]));
            });
            $row->column(6, function (Column $column) {
                //group pesons with disabilities by categories
                $persons = DB::table('people')
                    ->select('place_of_birth', DB::raw('COUNT(*) as count'))
                    ->groupBy('place_of_birth')
                    ->get();

                // dd($persons);


                $column->append(view('widgets.by-place-of-birth', [
                    'title' => 'Persons with Disabilities by Place Of Birth',
                    'data' => $persons->pluck('count')->toArray(),
                    'labels' =>  $persons->pluck('count', 'place_of_birth')->map(function ($count, $name) {
                                        return "$name - $count";
                                    })->values()->toArray()
                ]));
            });
---
select `disabilities`.`name`, COUNT(*) as count from `people` inner join `disability_person` on `people`.`id` = `disability_person`.`person_id` inner join `disabilities` on `disability_person`.`disability_id` = `disabilities`.`id` group by `disabilities`.`name`
select `place_of_birth`, COUNT(*) as count from `people` group by `place_of_birth`