app/Admin/Controllers/HomeController.php

select count(*) as aggregate from `organisations` where `relationship_type` = 'du'
select count(*) as aggregate from `organisations` where `relationship_type` = 'opd'
select count(*) as aggregate from `service_providers`
select count(*) as aggregate from `people`
---
    public function index(Content $content)
    {


        $u = Admin::user();
        $admin_role = $u->roles->first()->slug;
        //if the user is not an admin, redirect to the guests page
        if ($u && $admin_role == 'basic') {
            return redirect()->route('pwd-dashboard');
        }
        if ($admin_role == 'district-union') {
            return redirect()->route('du-dashboard');
        }
        if ($u && $admin_role == 'pwd') {
            return redirect()->route('pwd-dashboard');
        }

        $content->row(function (Row $row) {
            $row->column(3, function (Column $column) {
                $column->append(view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Number Of DUs',
                    'sub_title' => 'dus',
                    'number' => Organisation::where('relationship_type', '=', 'du')->count(),
                    'link' => admin_url('district-unions'),
                    'font_size' => '1.5em'
                ]));
            });
            $row->column(3, function (Column $column) {
                $column->append(view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Number Of NOPDs',
                    'sub_title' => 'nopds',
                    'font_size' => '1.5em',
                    'number' => Organisation::where('relationship_type', '=', 'opd')->count(),
                    'link' => admin_url('opds'),
                ]));
            });
            $row->column(3, function (Column $column) {
                $column->append(view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Service providers',
                    'sub_title' => 'service providers',
                    'number' => ServiceProvider::count(),
                    'link' => admin_url('service-providers'),
                ]));
            });

            $row->column(3, function (Column $column) {
                $column->append(view('widgets.box-5', [
                    'is_dark' => false,
                    'title' => 'Persons with Disability',
                    'sub_title' => 'pwds',
                    'number' => Person::count(),
                    'link' => admin_url('people'),
                ]));