app/Admin/Controllers/OPDController.php

select `name`, `name` from `regions`
select `membership_type`, `membership_type` from `organisations`
---
    protected function grid()
    {
        $grid = new Grid(new Organisation());
        $grid->disableBatchActions();
        $grid->quickSearch('name')->placeholder('Search by Name');
        $grid->filter(function ($filter) {
            $filter->disableIdFilter();
            //Filters for region, Membership type and date of registration
            $filter->equal('region.name', 'Region')
                ->select(Region::pluck('name', 'name'));
            $filter->equal('membership_type', 'Membership Type')
                ->select(Organisation::pluck('membership_type', 'membership_type'));