app/Admin/Controllers/PersonController.php

    protected function form()
    {
        // $education_level = Dashboard::getEducationByGender();
        // dd($education_level);
        $form = new Form(new Person());

        $form->footer(function ($footer) {
            $footer->disableReset();
            $footer->disableViewCheck();
            $footer->disableEditingCheck();
            $footer->disableCreatingCheck();
            $footer->disableSubmit();
        });
        $form->tab('Bio', function ($form) {
            $form->image('photo', __('Photo'))->uniqueName();
            $form->text('name', __('Surname'))->placeholder('Surname')->rules('required');
            $form->text('other_names', __('Other Names'))->placeholder('Other Names')->rules('required');
            $form->select('sex', __('Gender'))->options(['Male' => 'Male', 'Female' => 'Female'])->rules('required');
            $form->multipleSelect('disabilities', __('Select disabilities'))
                ->rules('required')
                ->options(Disability::orderBy('name', 'asc')->get()->pluck('name', 'id'));
            $form->date('dob', __('Date of Birth'))->rules('required')->format('DD-MM-YYYY')->placeholder('DD-MM-YYYY')->rules('required');
            $form->number('age', __('Age'))->placeholder('Age')->rules('required')->min(0);
---
select * from `disabilities` order by `name` asc

                        $form->radio('select_opd_or_du', __('Select '))->options(['opd' => 'OPD', 'du' => 'DU'])
                            ->help("Are you a member of an OPD or DU?")
                            ->when('du', function (Form $form) {
                                $form->select('district_id', __('Select  District'))->options(District::pluck('name', 'id'))->placeholder('Select District')->rules("required")
                                    ->help("Select the District where your DU is located");
                            })
                            ->when('opd', function (Form $form) {

                                $form->select('opd_id', __('Select  OPD'))->options(Organisation::where('membership_type', 'individual-based')->where('relationship_type', 'opd')->pluck('name', 'id'))->placeholder('Select an OPD')->rules("required");
---
select `name`, `id` from `districts`
select `name`, `id` from `organisations` where `membership_type` = 'individual-based' and `relationship_type` = 'opd'