app/Admin/Controllers/PersonController.php

            ->help("NIN, Passport Number, Driving Permit Number");

        $u = Admin::user();
        $organisation = Organisation::where('user_id', $u->id)->first();
---
select * from `organisations` where `user_id` = 1 limit 1