app/Admin/Controllers/PersonController.php

    protected function grid()
    {

        $grid = new Grid(new Person());

        //TODO: fix filters, and also display users from the opd, and district unions


        $grid->filter(function ($filter) {
            // Remove the default id filter
            $filter->disableIdFilter();
            //filter by district, Gender, and disability type
            $filter->equal('district_id', 'Filter by district')
                ->select(District::orderBy('name', 'asc')->get()->pluck('name', 'id'));

            $filter->equal('sex', 'Filter by Gender')->select([
                'Male' => 'Male',
                'Female' => 'Female',
            ]);
            $filter->equal('disabilities.name', 'Disability Name')
                ->select(Disability::pluck('name', 'name'));
        });

        $grid->quickSearch('name')->placeholder('Search by name');

        $user = auth("admin")->user();
        $organisation = Organisation::where('user_id', $user->id)->first();
---
select `name`, `name` from `disabilities`
select * from `organisations` where `user_id` = 1 limit 1

            function ($is_formal_education) {
                $levels = [
                    'phd' => 'PHD',
                    'master\'s degree' => 'Master\'s Degree',
                    'bachelor\'s degree' => 'Bachelor\'s Degree',
                    'diploma' => 'Diploma',
                    'secondary-uace' => 'Secondary - UACE',
                    'secondary-uce' => 'Secondary - UCE',
                    'primary' => 'Primary - PLE',
                ];
                if (array_key_exists($is_formal_education, $levels)) {
                    return $levels[$is_formal_education];
                } else {
                    return 'Not mentioned';
                }
            }
        )->sortable();
        $grid->column('informal_education', __('Informal Education'));

        $grid->column('district_id', __('Attached District'))->display(
            function ($x) {
                if ($this->district == null) {
                    return '-';
                }
                return $this->district->name;
            }
        )->sortable();

        $grid->column('profiler', __('Profiler'));

        $grid->column('disabilities', __('Disabilities'))
            ->display(
                function ($x) {
                    //disabilities in badges
                    if ($this->disabilities()->count() > 0) {
                        $disabilities = $this->disabilities->map(function ($item) {
                            return  $item->name;
                        })->toArray();
                        return join(',', $disabilities);
                    } else {
                        return '-';
                    }
                }
            );
---
select * from `districts` where `districts`.`id` = 123 limit 1
select count(*) as aggregate from `disabilities` inner join `disability_person` on `disabilities`.`id` = `disability_person`.`disability_id` where `disability_person`.`person_id` = 61164
select count(*) as aggregate from `disabilities` inner join `disability_person` on `disabilities`.`id` = `disability_person`.`disability_id` where `disability_person`.`person_id` = 61180

    protected function form()
    {
        // $education_level = Dashboard::getEducationByGender();
        // dd($education_level);
        $form = new Form(new Person());

        $form->footer(function ($footer) {
            $footer->disableReset();
            $footer->disableViewCheck();
            $footer->disableEditingCheck();
            $footer->disableCreatingCheck();
            $footer->disableSubmit();
        });
        $form->tab('Bio', function ($form) {
            $form->image('photo', __('Photo'))->uniqueName();
            $form->text('name', __('Surname'))->placeholder('Surname')->rules('required');
            $form->text('other_names', __('Other Names'))->placeholder('Other Names')->rules('required');
            $form->select('sex', __('Gender'))->options(['Male' => 'Male', 'Female' => 'Female'])->rules('required');
            $form->multipleSelect('disabilities', __('Select disabilities'))
                ->rules('required')
                ->options(Disability::orderBy('name', 'asc')->get()->pluck('name', 'id'));
            $form->date('dob', __('Date of Birth'))->rules('required')->format('DD-MM-YYYY')->placeholder('DD-MM-YYYY')->rules('required');
            $form->number('age', __('Age'))->placeholder('Age')->rules('required')->min(0);
---
select * from `disabilities` order by `name` asc



        if (!$user->inRoles(['district-union', 'opd'])) {
            $form->tab('Memberships', function ($form) {
                $form->radio('is_member', __('Membership'))->options([1 => 'Yes', 0 => 'No'])->rules('required')
                    ->when(1, function (Form $form) {
                        $form->radio('select_opd_or_du', __('Select '))->options(['opd' => 'OPD', 'du' => 'DU'])
                            ->help("Are you a member of an OPD or DU?")
                            ->when('du', function (Form $form) {
                                $form->select('district_id', __('Select  District'))->options(District::pluck('name', 'id'))->placeholder('Select District')->rules("required")
                                    ->help("Select the District where your DU is located");
                            })
                            ->when('opd', function (Form $form) {

                                $form->select('opd_id', __('Select  OPD'))->options(Organisation::where('membership_type', 'individual-based')->where('relationship_type', 'opd')->pluck('name', 'id'))->placeholder('Select an OPD')->rules("required");
                            })
                            ->default('opd');
                        // $form->select('organisation_name', __('Select  DU / OPD'))->options(Organisation::where('membership_type','pwd')->pluck('name','id') )->placeholder('Select an Organisation')->rules("required");

                    })
                    ->help("Are you currently a member of any association? or have you ever been a member of any association?");
                $form->divider();
                $form->html('
                    <a type="button" class="btn btn-info btn-prev float-left" data-toggle="tab" aria-expanded="true">Previous</a>
---
select `name`, `id` from `districts`
select `name`, `id` from `organisations` where `membership_type` = 'individual-based' and `relationship_type` = 'opd'