app/Admin/Controllers/ServiceProviderController.php

select * from `disabilities` order by `name` asc
---
    protected function grid()
    {

        $grid = new Grid(new ServiceProvider());

        $grid->filter(function ($filter) {
            $filter->disableIdFilter();
            $filter->like('districts_of_operation', 'Filter by district')
                ->select(District::orderBy('name', 'asc')->get()->pluck('name', 'name'));

            $filter->equal('target_group', 'Target Group')->select([
                'Children' => 'Children',
                'Adults' => 'Adults',
                'Parents' => 'Parents',
                'Others' => 'Others'
            ]);
            $filter->like('disability_category', 'Disability Category')
                ->select(Disability::orderBy('name', 'asc')->get()->pluck('name', 'name'));
            // ->select(Disability::pluck('name', 'name'));
        });
        if (!Admin::user()->inRoles(['administrator', 'nudipu'])) {
            $grid->disableCreateButton();
            $grid->actions(function ($actions) {
                $actions->disableDelete();
                $actions->disableEdit();
            });
        }
        $grid->model()->orderBy('created_at', 'desc');
        $grid->exporter(new ServiceProvidersExcelExporter());

        $grid->column('name', __('Name'));