app/Admin/Controllers/ServiceProviderController.php

select count(*) as aggregate from `disabilities` inner join `disability_service_provider` on `disabilities`.`id` = `disability_service_provider`.`disability_id` where `disability_service_provider`.`service_provider_id` = 183
select count(*) as aggregate from `districts` inner join `district_service_provider` on `districts`.`id` = `district_service_provider`.`district_id` where `district_service_provider`.`service_provider_id` = 168
---
        $grid->column('email', __('Email'));
        $grid->column('telephone', __('Telephone'));
        $grid->column('target_group', __('Target group'));
        $grid->column('disability_categories', __('Disability category'))
            ->display(
                function ($x) {
                    //disabilities in badges
                    if ($this->disability_categories()->count() > 0) {
                        $disabilities = $this->disability_categories->map(function ($item) {
                            return  $item->name;
                        })->toArray();
                        return join(', ', $disabilities);
                    } else {
                        return '-';
                    }
                }
            );
        $grid->column('level_of_operation', __('Level of operation'));
        $grid->column('districts_of_operations', __('Districts of Operation'))
            ->display(
                function ($x) {
                    //disabilities in badges
                    if ($this->districts_of_operations()->count() > 0) {
                        $districts = $this->districts_of_operations->map(function ($item) {
                            return  $item->name;
                        })->toArray();
                        return join(', ', $districts);
                    } else {
                        return '-';
                    }
                }
                // function ($districts) {
                //     $districts = [];
                //     foreach ($districts as $district) {
                //         $districts[] = $district['name'];
                //     }
                //     return join(', ', $districts);
                // }
            );