app/Http/Controllers/MainController.php

select `districts`.`name` as `district`, COUNT(*) as total from `people` inner join `districts` on `people`.`district_id` = `districts`.`id` group by `district` order by total DESC limit 5
select `disabilities`.`name`, COUNT(*) as count from `people` inner join `disability_person` on `people`.`id` = `disability_person`.`person_id` inner join `disabilities` on `disability_person`.`disability_id` = `disabilities`.`id` group by `disabilities`.`name`
---
    $male_percentage = round($male_pwd / $total * 100);

    //get top 5 districts with persons with disabilities
    $districts_count = DB::table('people')
      ->join('districts', 'people.district_id', '=', 'districts.id')
      ->select('districts.name as district', DB::raw('COUNT(*) as total'))
      ->groupBy('district')
      ->orderByRaw('total DESC')
      ->limit(5)
      ->get();


    //get persons by disability type
    $persons_by_disability = DB::table('people')
      ->join('disability_person', 'people.id', '=', 'disability_person.person_id')
      ->join('disabilities', 'disability_person.disability_id', '=', 'disabilities.id')
      ->select('disabilities.name', DB::raw('COUNT(*) as count'))
      ->groupBy('disabilities.name')
      ->get();