app/Models/NewsPost.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function created_by()
    {
        $u = Administrator::find($this->user_id);