app/Models/Organisation.php

select * from `districts` where `districts`.`id` = '57' limit 1
---
    public static function get_region($district_id)
    {
        $district = District::with('region')->find($district_id);