app/Models/Person.php

    public static function updateDistrictOfResidence()
    {
        $admin = Admin::user();
        $organisation = Organisation::where('name', $admin->name)->first();
---
select * from `organisations` where `name` = 'MITYANA DISTRICT UNION DISABLED PERSONS'