app/Models/User.php

    public function assignRole(String $role)
    {
        $role = AdminRole::where('slug', $role)->first();
        DB::table('admin_role_users')->insert([
            'role_id' => $role->id,
            'user_id' => $this->id
        ]);
---
select * from `admin_roles` where `slug` = 'district-union' limit 1
insert into `admin_role_users` (`role_id`, `user_id`) values (5, 578)