app/Models/Utils.php

    public static function system_boot()
    {
        $u = Admin::user();

        if ($u != null) {
            $r = AdminRoleUser::where([
                'user_id' => $u->id
            ])->first();
---
select * from `admin_role_users` where (`user_id` = 1) limit 1